[
  {
    "team_id": "4",
    "items": [
      {
        "title": "The technical interview practice gap, and how it keeps underrepresented groups out of software engineering",
        "content": "We helped write the sequel to \"Cracking the Coding Interview\". [Read 9 chapters for free →](https://bctci.co/free-chapters)\n\n[interviewing.io](https://interviewing.io/)\n\nOpen menu\n\nInterview resources\n\n- [For employers](https://interviewing.io/employers)\n- [Gift mock interviews](https://interviewing.io/gift-practice-interviews)\n- [Blog](https://interviewing.io/blog)\n- [FAQ](https://interviewing.io/faq)\n- [Log in](https://start.interviewing.io/login)\n[Give it a try](https://interviewing.io/signup)\n\n# The technical interview practice gap, and how it keeps underrepresented groups out of software engineering\n\nBy Aline Lerner \\| Published: March 8, 2021; Last updated: May 23, 2024\n\nI’ve been hiring engineers in some capacity for the past decade, and five years ago I founded interviewing.io, a technical recruiting marketplace that provides engineers with anonymous mock interviews and then fast-tracks top performers—regardless of who they are or how they look on paper—at top companies.\n\nWe’ve hosted close to 100K technical interviews on our platform and have helped thousands of engineers find jobs. Since last year, we’ve also been running a [Fellowship program specifically for engineers from underrepresented backgrounds](https://interviewing.io/blog/announcing-the-interviewing-io-technical-interview-practice-fellowship).\n\nAll that is to say that even though I have strong opinions about “diversity hiring” initiatives, I’ve acquired them the honest way, through laboratory experience.\n\nThough I find it problematic to label any type of hiring as “diversity hiring” —primarily because it tacitly implies to candidates and everyone else involved that they are getting the job not because of their merits but because of their demographics or to fill some quota—nomenclature is not my main critique of these initiatives. Though there are a number of big issues with how employers approach hiring, in this post I’ll talk about the one that’s at once the most subtle and the most damaging: **systematically ignoring the technical interview practice gap between traditional and non-traditional candidates**. I’ll explain exactly what the interview practice gap is and why it’s so bad in a moment, but first, allow me to tell you a little story.\n\n## The benefit of attending an elite CS university\n\nI was fortunate enough to attend MIT for undergrad. Probably the greatest gift that MIT gave me was a big stamp on my forehead that, to this day, makes strangers think I’m smart. But there was another, more relevant gift that gave me a serious advantage over students who did not attend an elite computer science institution: boundless access to technical interview practice.\n\nNot only was there a multi-week course during the month-long break between Fall and Spring semesters that was dedicated exclusively to passing technical interviews, but all of my peers were going through exactly the same thing at the same time. Everyone was interviewing at FAANG for internships and new grad positions, which meant that we could all practice with each other, share our successes and failures, and, over time, internalize just how much of technical interviewing is a numbers game. **We learned that bombing a Google interview did not mean that you weren’t meant to be an engineer. It just meant that you needed to work some more problems, do more mock interviews, and try again at Facebook.**\n\n## Practice, practice, practice\n\nMy anecdotal experience aside, we at interviewing.io have actual data. As I mentioned earlier, we’ve hosted close to 100K interviews on our platform. It has taught us two very important things. This interview style is controversial, in part because it’s not entirely similar to the work software engineers do every day but also because 1) like standardized testing, it’s a learned skill, and 2) unlike standardized testing, interview results are not consistent or repeatable—the same candidate can do well in one interview and fail another one the same day.\n\n**First, regardless of how strong you are technically, practice really matters.** In a recent study, [we looked at how people who got jobs at FAANG performed](https://interviewing.io/blog/how-know-ready-interview-faang) in practice vs. those who did not. Below is a graph of average technical score in interviews and the portion of people with each score who passed Facebook’s interview process.\n\n![](https://strapi-iio.s3.us-west-2.amazonaws.com/Clean_Shot_2022_12_16_at_19_21_52_2x_592c564655.png)\n\nYou can see that technical ability did not obviously associate with interview success. So what did? It turned out that the number of practice interviews people completed (either on interviewing.io or off) had a much bigger bearing, as you can see below. Surprisingly, no other factors we included in our model (seniority, gender, degree, etc.) mattered at all.\n\n![](https://strapi-iio.s3.us-west-2.amazonaws.com/Clean_Shot_2022_12_16_at_19_22_05_2x_1974c0c5ce.png)\n\n**Secondly, technical interview performance from interview to interview is fairly inconsistent, even among strong candidates.** Notably, as above, consistency appears to have nothing to do with seniority, pedigree, or anything else. **In fact, only about 20% of interviewees perform consistently from interview to interview. Why does this matter? Once you’ve done a few traditional technical interviews, the volatility and lack of determinism in the process is something you figure out anecdotally and kind of accept.** And if you have the benefit of having friends who’ve also been through it, it only gets easier. But what if you don’t?\n\nIn a previous post, we talked about how [women quit interview practice 7 times more often than men](https://interviewing.io/blog/voice-modulation-gender-technical-interviews) after just one bad interview. It’s not too much of a leap to say that this is probably happening to any number of groups who are underrepresented/underserved by the current system. **In other words, though it’s a broken process for everyone, the flaws within the system hit these groups the hardest—just because they haven’t had the chance to internalize exactly how much of technical interviewing is a game.** Sadly, since we’ve started running our Fellowship program for engineers from underrepresented backgrounds, we’ve seen this effect firsthand.\n\n## The technical interview practice gap\n\nSo what does this have to do with the practice gap? As you can see in the graph above, **there was a pretty meaningful bump in performance** (almost 2X as likely to pass!) **after at least five practice interviews.** Five interviews is not a lot for someone who’s actively practicing and knows how the interview prep game works. **But it’s a far cry from what companies who are looking to boost their diversity numbers offer their candidates, and it’s equally far from what bootcamps, an increasingly important source of candidates from underrepresented backgrounds, provide their students.**\n\n### What employers are doing wrong\n\nI won’t name any specific companies here, but tech giants (many with good intentions and with marching orders to boost their diversity numbers) often do a considerable amount of outreach and pre-interview engagement with candidates from underrepresented backgrounds. This outreach is usually an info session where one engineer speaks to a virtual room of candidates from underrepresented backgrounds. The engineer tells them what to expect in technical interviews, encourages them to learn how to articulate their thought process out loud while solving a problem, and recommends resources like _Cracking the Coding Interview._ Some companies even go so far as to offer their underrepresented candidates a mock interview or two.\n\nUnfortunately, for candidates who are unfamiliar with the process, neither of these interventions is nearly enough.\n\n### What bootcamps are doing wrong\n\nBecause they’re cheaper and much faster than a four-year program, bootcamps seem like a rational choice when compared to the price of attending a top university. Since 2013, bootcamp enrollment has grown 9X, with a total of 20,316 graduates in 2018. Though these numbers represent enrollment across all genders and the raw number of grads lags behind CS programs, the portion of women graduating from bootcamps is also on the rise and graduation from online programs has actually reached gender parity (as compared to only 20% in traditional CS programs).\n\nDespite these encouraging numbers, things start to go sideways when it’s time for students to start interviewing for jobs, and disappointingly, what bootcamps provide their students isn’t much better than the tech giants with good intentions.\n\nAgain, without naming names, I’ve interacted in some capacity with almost every major bootcamp over the last few years, trying to sell them on providing interview practice for their students, and I’ve also witnessed how recent bootcamp grads perform in mock interviews on interviewing.io. Based on these observations, bootcamps seem to have two big limitations: not nearly enough time spent on data structures and algorithms in the curriculum and lack of interview prep support both during and after the program.\n\nDiscussing bootcamp curriculum is out of the scope of this post, but I will say a few words about how bootcamps handle interview preparation. Bootcamps, by and large, have pretty thin margins and can’t invest much in paying for interview prep or hiring engineers to do it. As such, if they do offer mock interviews with professionals, just like tech companies, they tend to cap them at one or two, which we know isn’t nearly enough.\n\nIf they do not offer mock interviews with professionals (and most do NOT), they instead tend to focus on peer to peer practice (students interviewing other students), or they solicit volunteers from their pool of recent alums. While peer interviews are not entirely useless, they’re a far cry from working with someone who knows what the interview process is like. For the price tag that bootcamps charge their students, it’s appalling that they’re unable to invest resources into the last mile: actually getting their students ready for interviews.\n\nThat’s not to say that bootcamp grads are not viable employees. If that were true, I wouldn’t be advocating bootcamps as a means of increasing diversity in software engineering. What’s heartbreaking is that bootcamp students have all the makings of good engineers—they just need to spend an extra 3-6 months after graduation drilling by themselves on the skills their programs should have offered them.\n\nWhile I have less direct experience with curriculum and career centers at non-elite universities (another contributor to the practice gap), from speaking with students who attend these schools, it’s clear that access to consistent interview prep is hard to come by, especially when compared to what’s available at their more elite counterparts.\n\n## The cost of falling short\n\nWhy are bootcamps, universities, and employers all falling short and exacerbating the practice gap? With both employers and bootcamps, the teams responsible for facilitating interview info sessions or mock interviews typically consist of career coaches who don’t come from a technical background and therefore don’t have a good grasp of the difference between preparing for behavioral interviews and technical ones … and the big gulf between the two.\n\nBehavioral interviews aren’t easy, sure, but they don’t require you to get used to a completely different mode of communication while simultaneously solving hard problems and turning them into code as someone breathes down your neck. Nor do behavioral interviews require hours and hours of grinding and drilling.\n\nPreparing for technical interviews (and other analytical, domain-specific interviews… see the Tweet about management consulting below) is much more like studying for a math test than it is about practicing presenting yourself and telling your story. But until you’ve done it, you won’t really get it.\n\n![](https://strapi-iio.s3.us-west-2.amazonaws.com/Clean_Shot_2022_12_16_at_19_22_19_2x_5d1b0fcf7f.png)\n\nThe most heartbreaking effect of the practice gap is this. Companies, under fire for hiring exclusively from top schools, expand their recruiting efforts and start targeting a broader range of schools and programs. One of the boldest programs of this type interviewed every CS student at each HBCU to develop a pipeline of African American candidates. Sadly, because of the interview practice gap, good-intentioned programs like this are destined to fail. A 2016 piece in Bloomberg (“ [Why Doesn’t Silicon Valley Hire Black Coders?](https://www.bloomberg.com/tosv2.html?vid=&uuid=324fb7d1-d308-11ed-a129-7179624d4b55&url=L2ZlYXR1cmVzLzIwMTYtaG93YXJkLXVuaXZlcnNpdHktY29kZXJzLw==)”) covered this problem extensively:\n\n> _When they started interviewing seniors, companies found—as Pratt did at Howard—that many were underprepared. They hadn’t been exposed to programming before college and had gaps in their college classes. The companies were coming into the process too late. So many of them have created programs geared toward freshmen and sophomores._\n\n**Then, when the initiative inevitably fails, companies walk away with their conscious biases about the “superiority” of top schools confirmed. Or even worse, this confirms their unconscious biases about race and/or gender, when the real problem isn’t the students but their lack of access to interview practice.**\n\n## How you can (actually!) help\n\nA few years ago, we ran a study that examined interview performance by school tier. Among students who were actively and regularly practicing technical interviewing, [there was no difference in performance between elite schools and non-elite schools](https://interviewing.io/blog/we-looked-at-how-a-thousand-college-students-performed-in-technical-interviews-to-see-if-where-they-went-to-school-mattered-it-didnt)!\n\n![Chart showing new grad interview performance by school tier](https://interviewing.io/_next/image?url=https%3A%2F%2Fstrapi-iio.s3.us-west-2.amazonaws.com%2Fnew_grad_interview_performance_008804d4ed.png&w=1920&q=75)\n\nAll that is to say that **with at least 5 professional mock interviews per candidate, we could close the practice gap, level the playing field in software engineering, and hit our representation goals.** This is a bold statement, but in my decade plus of operating in this space, I have not seen anything as effective at closing the gap in tech as getting everyone technical interview practice. If you’re an employer, I urge you to consider the following:\n\n- **Create a program where you sponsor interview practice for your candidates**, especially those who aren’t socialized in technical interviews. I don’t care if it’s through interviewing.io or through someone else. Just do it.\n- One mock interview is not enough. An info session is not enough. **You need at least five interviews to move the needle**, and they need to happen systematically and on a schedule. But you know what? It’s a few hundred dollars per candidate. Compared to the cost of sourcing and interviewing them, it’s peanuts.\n- You may want to think about routing some of your D&I budget toward this purpose. **If you’re spending any appreciable amount of money on initiatives like unconscious bias training**, [which has been shown over and over not to work](https://www.mckinsey.com/featured-insights/gender-equality/focusing-on-what-works-for-workplace-diversity), **you could make a much bigger dent by relocating that budget toward interview practice for your candidates**.\n\nThere is a lot of loud conversation in Silicon Valley about fixing representation in tech. **It’s time to stop talking and instead do something that actually moves the needle. If interviewing.io had the means to give five mock interviews to every student in the US who doesn’t have the ability to pay for them, we’d do it right now.**\n\nMy years of experience have shown me that there are countless members of underrepresented groups who are ready and able to be outstanding engineers, but who have been unable to pass their technical interview. We at interviewing.io are determined to make a difference, and we want to give people the same gift that MIT once gave me: the knowledge that interview practice is everything and that failing an interview doesn’t mean you’re not cut out for this career.\n\nIf you want to help us, [get in touch](mailto:hello@interviewing.io).\n\nLife is chaos and pain. Interview prep doesn't have to be.\n\n![Video Preview](https://interviewing.io/static/images/cyber-corgi/artboard.svg)\n\nGet instant access to anonymous mock interviews, salary negotiation, and the world's largest library of interview replays.\n\n[Get started](https://interviewing.io/signup)\n\n#### Related posts\n\n[Why AI can’t do hiring](https://interviewing.io/blog/why-ai-cant-do-hiring)\n\n[Hamtips, or why I still run the Technical Phone Screen as the Hiring Manager](https://interviewing.io/blog/hamtips-or-why-i-still-run-the-technical-phone-screen-as-the-hiring-manager)\n\n[A founder’s guide to making your first recruiting hire](https://interviewing.io/blog/a-founders-guide-to-making-your-first-recruiting-hire)\n\n[Are recruiters better than a coin flip at judging resumes? Here's the data.](https://interviewing.io/blog/are-recruiters-better-than-a-coin-flip-at-judging-resumes)\n\n#### Stuff we write about\n\n[Recession](https://interviewing.io/blog/category/recession) [Salary negotiation](https://interviewing.io/blog/category/salary-negotiation) [Company News](https://interviewing.io/blog/category/company-news) [Data Deep Dives](https://interviewing.io/blog/category/data-deep-dives) [Diversity](https://interviewing.io/blog/category/diversity) [Guest Posts](https://interviewing.io/blog/category/guest-posts) [Hiring is broken](https://interviewing.io/blog/category/hiring-is-broken) [Interview tips](https://interviewing.io/blog/category/interview-tips) [For employers, how to hire better](https://interviewing.io/blog/category/for-employers-how-to-hire-better)\n\n### Have interviews coming up? Study up on common questions and topics.\n\nMEDIUM\n\nData Structures and Algorithms\n\n### [Build a Max Heap From an Array](https://interviewing.io/questions/build-a-max-heap)\n\n[Given an array of integers, transform the array in-place to a max heap.](https://interviewing.io/questions/build-a-max-heap)\n\nHARD\n\nData Structures and Algorithms\n\n### [Longest Increasing Path in a Matrix](https://interviewing.io/questions/longest-increasing-path-in-a-matrix)\n\n[Given an m x n integers matrix, return the length of the longest increasing path in the matrix. You may only move up, down, left, or right.](https://interviewing.io/questions/longest-increasing-path-in-a-matrix)\n\nMEDIUM\n\nData Structures and Algorithms\n\n### [Partition List](https://interviewing.io/questions/partition-list)\n\n[Given a list of integers L and a number K, write a function that reorganizes L into three partitions: elements less than K, elements equal to K, and elements greater than K. No additional lists may be used.](https://interviewing.io/questions/partition-list)\n\n[Recursion](https://interviewing.io/recursion-interview-questions)\n\n[Questions \\\\\n\\\\\n& tips](https://interviewing.io/recursion-interview-questions)\n\n[Dynamic Programming](https://interviewing.io/dynamic-programming-interview-questions)\n\n[Questions \\\\\n\\\\\n& tips](https://interviewing.io/dynamic-programming-interview-questions)\n\n[Heaps](https://interviewing.io/heaps-interview-questions)\n\n[Questions \\\\\n\\\\\n& tips](https://interviewing.io/heaps-interview-questions)\n\n[Hash Tables](https://interviewing.io/hash-tables-interview-questions)\n\n[Questions \\\\\n\\\\\n& tips](https://interviewing.io/hash-tables-interview-questions)\n\n[Binary Search](https://interviewing.io/binary-search-interview-questions)\n\n[Questions \\\\\n\\\\\n& tips](https://interviewing.io/binary-search-interview-questions)\n\n[Breadth-First Search (BFS)](https://interviewing.io/breadth-first-search-interview-questions)\n\n[Questions \\\\\n\\\\\n& tips](https://interviewing.io/breadth-first-search-interview-questions)\n\n## We know exactly what to do and say to get the company, title, and salary you want.\n\nInterview prep and job hunting are chaos and pain. We can help. Really.\n\n![Google Icon](https://interviewing.io/static/images/icon--google-color.svg)\nGet started for free\n\n![App screenshot](https://interviewing.io/_next/image?url=%2Fstatic%2Fimages%2FFooterImg.png&w=3840&q=75)",
        "content_type": "web_page",
        "source_url": null,
        "author": "",
        "user_id": ""
      }
    ]
  },
  {
    "team_id": "4",
    "items": [
      {
        "title": "[Stop trying to make recruiters think, or, why your resume is bad and how to fix it](https://interviewing.io/blog/stop-trying-to-make-recruiters-think-or-why-your-resume-is-bad-and-how-to-fix-it)",
        "content": "We helped write the sequel to \"Cracking the Coding Interview\". [Read 9 chapters for free →](https://bctci.co/free-chapters)\n\n[interviewing.io](https://interviewing.io/)\n\nOpen menu\n\nInterview resources\n\n- [For employers](https://interviewing.io/employers)\n- [Gift mock interviews](https://interviewing.io/gift-practice-interviews)\n- [Blog](https://interviewing.io/blog)\n- [FAQ](https://interviewing.io/faq)\n- [Log in](https://start.interviewing.io/login)\n[Give it a try](https://interviewing.io/signup)\n\n# [Stop trying to make recruiters think, or, why your resume is bad and how to fix it](https://interviewing.io/blog/stop-trying-to-make-recruiters-think-or-why-your-resume-is-bad-and-how-to-fix-it)\n\nBy Aline Lerner \\| Published: April 29, 2025\n\n[![A list of high-ROI resume tweaks](https://interviewing.io/_next/image?url=https%3A%2F%2Fstrapi-iio.s3.us-west-2.amazonaws.com%2Fhigh_roi_resume_tweaks_f23aa49f90.png&w=1920&q=75)](https://interviewing.io/blog/stop-trying-to-make-recruiters-think-or-why-your-resume-is-bad-and-how-to-fix-it)\n\nYears ago, Steve Krug wrote a book about web design called _Don’t Make Me Think_. It’s a classic, and the main point is that good design should make everything painfully obvious to users without demanding anything of them.\n\nResumes are just the same. Your resume shouldn’t make recruiters think. It should serve up the most important things about you on a platter that they can digest in 30 seconds or less. We've said before that spending a lot of time on your resume is a fool's errand, but if you’re going to do _something_ to it, let’s make sure that that something is low-effort and high-return. Here's exactly what to do.\n\n[Read more >](https://interviewing.io/blog/stop-trying-to-make-recruiters-think-or-why-your-resume-is-bad-and-how-to-fix-it)\n\n# [Why resume writing is snake oil](https://interviewing.io/blog/why-resume-writing-is-snake-oil)\n\nBy Aline Lerner \\| Published: April 1, 2025\n\n[![A snake writing a resume](https://interviewing.io/_next/image?url=https%3A%2F%2Fstrapi-iio.s3.us-west-2.amazonaws.com%2Fresume_snake_oil_c599a39545.png&w=3840&q=75)](https://interviewing.io/blog/why-resume-writing-is-snake-oil)\n\nA lot of other platforms offer resume reviews or help with writing resumes for $$. We don't do it, despite a lot of our users asking for this feature. The reason I've refused to build them is because, simply put, resume writing is snake oil. Why? Because recruiters aren't reading resumes. If you don't have top brands, better wording won't help. If you do have top brands, the wording doesn't matter.\n\n[Read more >](https://interviewing.io/blog/why-resume-writing-is-snake-oil)\n\n# [It's OK to postpone your interviews if you're not ready](https://interviewing.io/blog/its-ok-to-postpone-your-interviews-if-youre-not-ready)\n\nBy Aline Lerner \\| Published: March 24, 2025; Last updated: April 27, 2025\n\n[![](https://interviewing.io/_next/image?url=https%3A%2F%2Fstrapi-iio.s3.us-west-2.amazonaws.com%2Fpostpone_interviews_11fc7978b0.png&w=3840&q=75)](https://interviewing.io/blog/its-ok-to-postpone-your-interviews-if-youre-not-ready)\n\nAt interviewing.io, we’ve seen hundreds of thousands of engineers go through job searches, and the biggest mistakes we see people make are all variations on the same theme: not postponing their interview when they aren’t ready. In most situations, there is no downside to postponing. In this post, we'll tell you what to do and say.\n\n[Read more >](https://interviewing.io/blog/its-ok-to-postpone-your-interviews-if-youre-not-ready)\n\n# [Read nine chapters of Beyond Cracking the Coding Interview for free](https://interviewing.io/blog/nine-free-chapters-of-beyond-cracking-the-coding-interview)\n\nBy Aline Lerner \\| Published: March 1, 2025; Last updated: April 27, 2025\n\n[![Beyond CtCI table of contents](https://interviewing.io/_next/image?url=https%3A%2F%2Fstrapi-iio.s3.us-west-2.amazonaws.com%2Fcover_toc_b77bec4593.png&w=3840&q=75)](https://interviewing.io/blog/nine-free-chapters-of-beyond-cracking-the-coding-interview)\n\nNine free chapters of [_Beyond Cracking the Coding Interview._](https://www.amazon.com/dp/195570600X) are now available for free.\n\nYou can find them [here](https://bctci.co/free-chapters).\n\nThey include:\n\n- **The first seven chapters of the book**, covering topics such as why technical interviews are broken, what recruiters won't tell you, why not to spend a lot of time on resumes, and how to get in the door at companies without a referral.\n- **Two technical chapters: Sliding Windows and Binary Search**. Our new take on Binary Search teaches one template that works for every binary search problem on LeetCode, with only a single-line change you need to remember. The Sliding Windows chapter features 6 unique sliding window templates that make off-by-one errors a thing of the past.\n\n[Read more >](https://interviewing.io/blog/nine-free-chapters-of-beyond-cracking-the-coding-interview)\n\n# [We co-wrote the official sequel to Cracking the Coding Interview!](https://interviewing.io/blog/we-co-wrote-the-official-sequel-to-cracking-the-coding-interview-introducing-beyond-ctci)\n\nBy Aline Lerner \\| Published: January 26, 2025; Last updated: April 27, 2025\n\n[![](https://interviewing.io/_next/image?url=https%3A%2F%2Fstrapi-iio.s3.us-west-2.amazonaws.com%2Fbctci_social_image_e1b3eed60a.png&w=3840&q=75)](https://interviewing.io/blog/we-co-wrote-the-official-sequel-to-cracking-the-coding-interview-introducing-beyond-ctci)\n\nGayle Laakmann McDowell, Mike Mroczka, and Nil Mamano, and I have written the official sequel to _Cracking the Coding Interview_ (often called the bible of technical interview prep). The sequel is fittingly called _Beyond Cracking the Coding Interview_.\n\nWe cover everything you need to know for today's tougher technical interviews and hiring climate. We have (at least) thirteen new technical topics and over 150 new problems. We’ve also drawn on a decade of hiring data and 100k interviews from interviewing.io to help you get noticed, manage your job search, and negotiate the best possible offer.\n\n![Beyond CtCI table of contents](https://strapi-iio.s3.us-west-2.amazonaws.com/cover_toc_b77bec4593.png)\n\n[The book is available now](https://www.amazon.com/dp/195570600X), and purchases come with $50 off on interviewing.io... given that it costs ~$45, it's not a bad deal.\n\n[Read more >](https://interviewing.io/blog/we-co-wrote-the-official-sequel-to-cracking-the-coding-interview-introducing-beyond-ctci)\n\n# [I love meritocracy, but all the recent anti-DEI rhetoric is bad](https://interviewing.io/blog/i-love-meritocracy-but-all-the-recent-anti-dei-rhetoric-is-bad)\n\nBy Aline Lerner \\| Published: October 2, 2024; Last updated: October 31, 2024\n\n[![](https://interviewing.io/_next/image?url=https%3A%2F%2Fstrapi-iio.s3.us-west-2.amazonaws.com%2Fmeritocracy_dei_dr_strangelove_1227c595ba.png&w=3840&q=75)](https://interviewing.io/blog/i-love-meritocracy-but-all-the-recent-anti-dei-rhetoric-is-bad)\n\nI’m the founder of interviewing.io, and in some ways, I’m the meritocracy hipster who was [writing about how eng hiring should be meritocratic](https://blog.alinelerner.com/silicon-valley-hiring-is-not-a-meritocracy/) and about [how quotas are bad](https://blog.alinelerner.com/diversity-quotas-suck-heres-why/), way before saying either was cool. At interviewing.io, my team and I have been trying to make hiring meritocratic for the last decade.\n\nI’ll also be the first to admit that DEI is ideologically flawed because of its emphasis on race and gender-based outcomes and its insistence on equality of those outcomes. In the last decade, we've seen a lot of bad stuff done in the name of DEI, firsthand. I'll talk about those in this post.\n\nBut all the recent pro-meritocracy, anti-DEI rhetoric is bad. Yelling “Meritocracy!” as if it’s a fait accompli is just as harmful as the worst parts of DEI. I’d even go so far to say that the DEI movement has done more for meritocracy than the loud pro-meritocracy movement is doing right now.\n\nI’m delighted that “meritocracy” is no longer a dirty word. But, just saying it isn’t enough. We have to change our hiring practices. We need to stop using meritocracy as a shield to preserve the status quo.\n\nIn this post, I talk about the flaws of DEI, the false promise of meritocracy, and what to do to actually make hiring meritocratic and fair.\n\n[Read more >](https://interviewing.io/blog/i-love-meritocracy-but-all-the-recent-anti-dei-rhetoric-is-bad)\n\n# [How well do LeetCode ratings predict interview performance? Here's the data.](https://interviewing.io/blog/how-well-do-leetcode-ratings-predict-interview-performance)\n\nBy Mike Mroczka \\| Published: September 11, 2024; Last updated: September 12, 2024\n\n[![](https://interviewing.io/_next/image?url=https%3A%2F%2Fstrapi-iio.s3.us-west-2.amazonaws.com%2Fprobability_of_faang_question_difficulty_og_a5d3272ed3.png&w=3840&q=75)](https://interviewing.io/blog/how-well-do-leetcode-ratings-predict-interview-performance)\n\nHave you ever wondered if you should spend more time on LeetCode, participate in those contests, or focus on solving harder problems? A popular Reddit post suggests you need 700+ questions and a LeetCode rating between 1800-2000 to pass FAANG interviews. Is this really what the data supports? To answer these questions and more, we looked at our users' LeetCode ranks and ratings and tied them back to interview performance on our platform and whether those users worked at FAANG.\n\nIn this post, we’ll share what we’ve learned.\n\n[Read more >](https://interviewing.io/blog/how-well-do-leetcode-ratings-predict-interview-performance)\n\n# [How to get in the door at top companies: cold outreach to hiring managers. Part 2 of 2.](https://interviewing.io/blog/how-to-get-in-the-door-at-top-companies-cold-out-reach-to-hiring-managers-part-2)\n\nBy Aline Lerner \\| Published: July 30, 2024; Last updated: November 2, 2024\n\n[![A diagram comparing the effectiveness and utility of all the recruitment/hiring channels to how much control you have over them.](https://interviewing.io/_next/image?url=https%3A%2F%2Fstrapi-iio.s3.us-west-2.amazonaws.com%2Feffectiveness_and_utility_quadrant_for_channels_1c6bec37f1.png&w=3840&q=75)](https://interviewing.io/blog/how-to-get-in-the-door-at-top-companies-cold-out-reach-to-hiring-managers-part-2)\n\nIn [part 1 of this post](https://interviewing.io/blog/how-to-get-in-the-door-at-top-companies-part-1), we analyzed different ways to get into companies along two axes: effectiveness and how much control you actually have.\n\nThe channel that maximizes both effectiveness and control is cold outreach to hiring managers (not recruiters!). And yet, most people do this type of outreach incorrectly. In this post, we'll tell you exactly what to do and what to say to reach out to hiring managers at top companies and get responses.\n\n[Read more >](https://interviewing.io/blog/how-to-get-in-the-door-at-top-companies-cold-out-reach-to-hiring-managers-part-2)\n\n# [How to get in the door at top companies: a data-driven, practical guide for software engineers. Part 1.](https://interviewing.io/blog/how-to-get-in-the-door-at-top-companies-part-1)\n\nBy Aline Lerner \\| Published: July 23, 2024; Last updated: October 28, 2024\n\n[![A diagram comparing the effectiveness and utility of all the recruitment/hiring channels to how much control you have over them.](https://interviewing.io/_next/image?url=https%3A%2F%2Fstrapi-iio.s3.us-west-2.amazonaws.com%2Feffectiveness_and_utility_quadrant_for_channels_1c6bec37f1.png&w=3840&q=75)](https://interviewing.io/blog/how-to-get-in-the-door-at-top-companies-part-1)\n\ninterviewing.io is an anonymous mock interview platform — we help engineers prepare for technical interviews. In this market, many of our users are struggling with getting in the door at companies, so we ran a survey to see what’s worked well and what hasn’t, in today’s difficult climate.\n\nNot surprisingly, warm referrals are the best way in. On the other hand, agency recruiters are clearly the worst. But not all channels are created equal. Some, like recruiters contacting you, you have minimal control over, and whether you get contacted is largely a function of whether you have top brands on your resume or belong to an underrepresented group. With others, like reaching out to hiring managers, you are fully in control of your destiny. Here's how to make the most of a difficult landscape.\n\n[Read more >](https://interviewing.io/blog/how-to-get-in-the-door-at-top-companies-part-1)\n\n# [Why engineers don’t like take-homes – and how companies can fix them](https://interviewing.io/blog/why-engineers-dont-like-take-homes-and-how-companies-can-fix-them)\n\nBy Aline Lerner \\| Published: July 16, 2024; Last updated: July 23, 2024\n\n[![Graph of brand strength vs. value asymmetry](https://interviewing.io/_next/image?url=https%3A%2F%2Fstrapi-iio.s3.us-west-2.amazonaws.com%2Fbrand_strength_vs_value_asymmetry_4bc96b83d4.png&w=3840&q=75)](https://interviewing.io/blog/why-engineers-dont-like-take-homes-and-how-companies-can-fix-them)\n\nWe surveyed almost 700 of our users about their experiences with take-homes and interviewed a handful more for deeper insights. We learned a lot—mostly about candidates' poor experiences and negative feelings toward take-homes. They take a lot of time. They don’t respect candidates’ time. Candidates often get no feedback. And candidates are almost never compensated. Really, it's all about value asymmetry.\n\nThe good news? Turns out there are some pretty simple things companies can do to vastly improve their take-home assignments\n\n[Read more >](https://interviewing.io/blog/why-engineers-dont-like-take-homes-and-how-companies-can-fix-them)\n\nLife is chaos and pain. Interview prep doesn't have to be.\n\n![Video Preview](https://interviewing.io/static/images/cyber-corgi/artboard.svg)\n\nGet instant access to anonymous mock interviews, salary negotiation, and the world's largest library of interview replays.\n\n[Get started](https://interviewing.io/signup)\n\n#### Most popular posts\n\n[Read nine chapters of Beyond Cracking the Coding Interview for free](https://interviewing.io/blog/nine-free-chapters-of-beyond-cracking-the-coding-interview)\n\n[We co-wrote the official sequel to Cracking the Coding Interview!](https://interviewing.io/blog/we-co-wrote-the-official-sequel-to-cracking-the-coding-interview-introducing-beyond-ctci)\n\n[Are recruiters better than a coin flip at judging resumes? Here's the data.](https://interviewing.io/blog/are-recruiters-better-than-a-coin-flip-at-judging-resumes)\n\n[The unwritten rules (till now) of negotiating with Meta](https://interviewing.io/blog/how-to-negotiate-with-meta)\n\n[How hard is it to cheat in technical interviews with ChatGPT? We ran an experiment.](https://interviewing.io/blog/how-hard-is-it-to-cheat-with-chatgpt-in-technical-interviews)\n\n[Exactly what to say when recruiters ask you to name the first number… and other negotiation word-for-words](https://interviewing.io/blog/negotiate-salary-recruiter)\n\n#### Stuff we write about\n\n[Recession](https://interviewing.io/blog/category/recession) [Salary negotiation](https://interviewing.io/blog/category/salary-negotiation) [Company News](https://interviewing.io/blog/category/company-news) [Data Deep Dives](https://interviewing.io/blog/category/data-deep-dives) [Diversity](https://interviewing.io/blog/category/diversity) [Guest Posts](https://interviewing.io/blog/category/guest-posts) [Hiring is broken](https://interviewing.io/blog/category/hiring-is-broken) [Interview tips](https://interviewing.io/blog/category/interview-tips) [For employers, how to hire better](https://interviewing.io/blog/category/for-employers-how-to-hire-better)\n\n## We know exactly what to do and say to get the company, title, and salary you want.\n\nInterview prep and job hunting are chaos and pain. We can help. Really.\n\n![Google Icon](https://interviewing.io/static/images/icon--google-color.svg)\nGet started for free\n\n![App screenshot](https://interviewing.io/_next/image?url=%2Fstatic%2Fimages%2FFooterImg.png&w=3840&q=75)",
        "content_type": "web_page",
        "source_url": null,
        "author": "",
        "user_id": ""
      }
    ]
  },
  {
    "team_id": "4",
    "items": [
      {
        "title": "We built voice modulation to mask gender in technical interviews. Here’s what happened.",
        "content": "We helped write the sequel to \"Cracking the Coding Interview\". [Read 9 chapters for free →](https://bctci.co/free-chapters)\n\n[interviewing.io](https://interviewing.io/)\n\nOpen menu\n\nInterview resources\n\n- [For employers](https://interviewing.io/employers)\n- [Gift mock interviews](https://interviewing.io/gift-practice-interviews)\n- [Blog](https://interviewing.io/blog)\n- [FAQ](https://interviewing.io/faq)\n- [Log in](https://start.interviewing.io/login)\n[Give it a try](https://interviewing.io/signup)\n\n# We built voice modulation to mask gender in technical interviews. Here’s what happened.\n\nBy Aline Lerner \\| Published: June 28, 2016; Last updated: May 1, 2024\n\n[interviewing.io](https://interviewing.io/) is a platform where people can practice technical interviewing anonymously and, in the process, find jobs based on their interview performance rather than their resumes. Since we started, we’ve amassed data from thousands of technical interviews, and in this blog, we routinely share some of the surprising stuff we’ve learned. In this post, I’ll talk about what happened when we built real-time voice masking to investigate the magnitude of bias against women in technical interviews. **In short, we made men sound like women and women sound like men and looked at how that affected their interview performance. We also looked at what happened when women did poorly in interviews, how drastically that differed from men’s behavior, and why that difference matters for the thorny issue of the gender gap in tech.**\n\n## The setup\n\nWhen an interviewer and an interviewee match on our platform, they meet in a collaborative coding environment with voice, text chat, and a whiteboard and jump right into a technical question. Interview questions on the platform tend to fall into the category of what you’d encounter at a phone screen for a back-end software engineering role, and interviewers typically come from a mix of large companies like Google, Facebook, Twitch, and Yelp, as well as engineering-focused startups like Asana, Mattermark, and others. For more context, some examples of interviews done on the platform can be found on our [mock interview](https://interviewing.io/mocks) page.\n\nAfter every interview, interviewers rate interviewees on a few different dimensions.\n\n![Feedback form for interviewers](https://interviewing.io/_next/image?url=https%3A%2F%2Fstrapi-iio.s3.us-west-2.amazonaws.com%2Fpseudonym_survey_86e6399c78.png&w=1200&q=75)\n\nAs you can see, we ask the interviewer if they would advance their interviewee to the next round. We also ask about a few different aspects of interview performance using a 1-4 scale. On our platform, a score of 3 or above is generally considered good.\n\n## Women historically haven’t performed as well as men…\n\nOne of the big motivators to think about voice masking was the increasingly uncomfortable disparity in interview performance on the platform between men and women.[1](https://interviewing.io/blog/voice-modulation-gender-technical-interviews#user-content-fn-1) At that time, we had amassed over a thousand interviews with enough data to do some comparisons and were surprised to discover that women really were doing worse. Specifically, **men were getting advanced to the next round 1.4 times more often than women. Interviewee technical score wasn’t faring that well either — men on the platform had an average technical score of 3 out of 4, as compared to a 2.5 out of 4 for women**.\n\nDespite these numbers, it was really difficult for me to believe that women were just somehow worse at computers, so when some of our customers asked us to build voice masking to see if that would make a difference in the conversion rates of female candidates, we didn’t need much convincing.\n\n## ...so we built voice masking\n\nSince we started working on interviewing.io, in order to achieve true interviewee anonymity, we knew that hiding gender would be something we’d have to deal with eventually but put it off for a while because it wasn’t technically trivial to build a real-time voice modulator. Some early ideas included sending female users a Bane mask.\n\n![Cartoon of the character Bane pretending to be Batman](https://interviewing.io/_next/image?url=https%3A%2F%2Fstrapi-iio.s3.us-west-2.amazonaws.com%2F1186d_bane_72ee94351f.webp&w=640&q=75)\n\nWhen the Bane mask thing didn’t work out, we decided we ought to build something within the app, and if you play the videos below, you can get an idea of what voice masking on interviewing.io sounds like. In the first one, I’m talking in my normal voice.\n\nInterview Without Voice Modulation - YouTube\n\n[Photo image of interviewing.io](https://www.youtube.com/channel/UCNc-Wa_ZNBAGzFkYbAHw9eg?embeds_referring_euri=https%3A%2F%2Finterviewing.io%2F)\n\ninterviewing.io\n\n93K subscribers\n\n[Interview Without Voice Modulation](https://www.youtube.com/watch?v=1OZlB08q8Lw)\n\ninterviewing.io\n\nSearch\n\nWatch later\n\nShare\n\nCopy link\n\nInfo\n\nShopping\n\nTap to unmute\n\nIf playback doesn't begin shortly, try restarting your device.\n\nYou're signed out\n\nVideos you watch may be added to the TV's watch history and influence TV recommendations. To avoid this, cancel and sign in to YouTube on your computer.\n\nCancelConfirm\n\nMore videos\n\n## More videos\n\nShare\n\nInclude playlist\n\nAn error occurred while retrieving sharing information. Please try again later.\n\n[Watch on](https://www.youtube.com/watch?v=1OZlB08q8Lw&embeds_referring_euri=https%3A%2F%2Finterviewing.io%2F)\n\n0:00\n\n0:00 / 0:12\n•Live\n\n•\n\n[Watch on YouTube](https://www.youtube.com/watch?v=1OZlB08q8Lw \"Watch on YouTube\")\n\nAnd in the second one, I’m modulated to sound like a man.[2](https://interviewing.io/blog/voice-modulation-gender-technical-interviews#user-content-fn-2)\n\nInterview With Voice Modulation - YouTube\n\n[Photo image of interviewing.io](https://www.youtube.com/channel/UCNc-Wa_ZNBAGzFkYbAHw9eg?embeds_referring_euri=https%3A%2F%2Finterviewing.io%2F)\n\ninterviewing.io\n\n93K subscribers\n\n[Interview With Voice Modulation](https://www.youtube.com/watch?v=XFqRIvd9d5s)\n\ninterviewing.io\n\nSearch\n\nWatch later\n\nShare\n\nCopy link\n\nInfo\n\nShopping\n\nTap to unmute\n\nIf playback doesn't begin shortly, try restarting your device.\n\nMore videos\n\n## More videos\n\nYou're signed out\n\nVideos you watch may be added to the TV's watch history and influence TV recommendations. To avoid this, cancel and sign in to YouTube on your computer.\n\nCancelConfirm\n\nShare\n\nInclude playlist\n\nAn error occurred while retrieving sharing information. Please try again later.\n\n[Watch on](https://www.youtube.com/watch?v=XFqRIvd9d5s&embeds_referring_euri=https%3A%2F%2Finterviewing.io%2F)\n\n0:00\n\n0:00 / 0:13\n•Live\n\n•\n\n[Watch on YouTube](https://www.youtube.com/watch?v=XFqRIvd9d5s \"Watch on YouTube\")\n\nArmed with the ability to hide gender during technical interviews, we were eager to see what the hell was going on and get some insight into why women were consistently underperforming.\n\n## The experiment\n\nThe setup for our experiment was simple. Every Tuesday evening at 7 PM Pacific, interviewing.io hosts what we call practice rounds. In these practice rounds, anyone with an account can show up, get matched with an interviewer, and go to town. And during a few of these rounds, **we decided to see what would happen to interviewees’ performance when we started messing with their perceived genders**.\n\nIn the spirit of not giving away what we were doing and potentially compromising the experiment, we told both interviewees and interviewers that we were slowly rolling out our new voice masking feature and that they could opt in or out of helping us test it out. Most people opted in, and we informed interviewees that their voice might be masked during a given round and asked them to refrain from sharing their gender with their interviewers. For interviewers, we simply told them that interviewee voices might sound a bit processed.\n\nWe ended up with 234 total interviews (roughly 2/3 male and 1/3 female interviewees), which fell into one of three categories:\n\n- Completely unmodulated (useful as a baseline)\n- Modulated without pitch change\n- Modulated with pitch change\n\nYou might ask why we included the second condition, i.e. modulated interviews that didn’t change the interviewee’s pitch. As you probably noticed, if you played the videos above, the modulated one sounds fairly processed. The last thing we wanted was for interviewers to assume that any processed-sounding interviewee must summarily have been the opposite gender of what they sounded like. So we threw that condition in as a further control.\n\n## The results\n\nAfter running the experiment, we ended up with some rather surprising results. **Contrary to what we expected** (and probably contrary to what you expected as well!), **masking gender had no effect on interview performance** with respect to any of the scoring criteria (would advance to next round, technical ability, problem solving ability). If anything, we started to notice some trends in the opposite direction of what we expected: for technical ability, it appeared that men who were modulated to sound like women did a bit better than unmodulated men and that women who were modulated to sound like men did a bit worse than unmodulated women. Though these trends weren’t statistically significant, I am mentioning them because they were unexpected and definitely something to watch for as we collect more data.\n\nOn the subject of sample size, we have no delusions that this is the be-all and end-all of pronouncements on the subject of gender and interview performance. We’ll continue to monitor the data as we collect more of it, and it’s very possible that as we do, everything we’ve found will be overturned. I will say, though, that had there been any staggering gender bias on the platform, with a few hundred data points, we would have gotten some kind of result. So that, at least, was encouraging.\n\n## So if there’s no systemic bias, why are women performing worse?\n\nAfter the experiment was over, I was left scratching my head. If the issue wasn’t interviewer bias, what could it be? I went back and looked at the seniority levels of men vs. women on the platform as well as the kind of work they were doing in their current jobs, and neither of those factors seemed to differ significantly between groups. But there was one nagging thing in the back of my mind. I spend a lot of my time poring over interview data, and I had noticed something peculiar when observing the behavior of female interviewees. Anecdotally, it seemed like women were leaving the platform a lot more often than men. So I ran the numbers.\n\nWhat I learned was pretty shocking. **As it happens, women leave interviewing.io roughly 7 times as often as men after they do badly in an interview.** And the numbers for two bad interviews aren’t much better. You can see the breakdown of attrition by gender below (the differences between men and women are indeed statistically significant with P < 0.00001).\n\nAttrition After Poor Interview Performance \\| grouped bar chart made by Aline\\_interviewingio \\| plotly\n\n12020\n\nWomenMenAttrition After Poor Interview PerformanceQuit After This Many Bad Interviews% of Users by Gender\n\n[Edit chart](https://plotly.com/create/?fid=aline_interviewingio:875)\n\nAlso note that as much as possible, I corrected for people leaving the platform because they found a job (practicing interviewing isn’t that fun after all, so you’re probably only going to do it if you’re still looking), were just trying out the platform out of curiosity, or they didn’t like something else about their interviewing.io experience.\n\n## A totally speculative thought experiment\n\nSo, if these are the kinds of behaviors that happen in the interviewing.io microcosm, how much is applicable to the broader world of software engineering? Please bear with me as I wax hypothetical and try to extrapolate what we’ve seen here to our industry at large. And also, please know that what follows is very speculative, based on not that much data, and could be totally wrong… but you gotta start somewhere.\n\nIf you consider the attrition data points above, you might want to do what any reasonable person would do in the face of an existential or moral quandary, i.e. fit the data to a curve. An exponential decay curve seemed reasonable for attrition behavior, and you can see what I came up with below. The x-axis is the number of what I like to call “attrition events”, namely things that might happen to you over the course of your computer science studies and subsequent career that might make you want to quit. The y-axis is what portion of people are left after each attrition event. The red curve denotes women, and the blue curve denotes men.\n\n![Chart showing the gender gap](https://interviewing.io/_next/image?url=https%3A%2F%2Fstrapi-iio.s3.us-west-2.amazonaws.com%2Fe92a1_gender_gap_v2_d243a94167.webp%3Fupdated_at%3D2022-12-08T14%3A31%3A14.044Z&w=1920&q=75)\n\nSee interactive graph with Demos: [https://www.desmos.com/calculator/tugmyjkaj6](https://www.desmos.com/calculator/tugmyjkaj6)\n\nNow, as I said, this is pretty speculative, but it really got me thinking about what these curves might mean in the broader context of women in computer science. How many “attrition events” does one encounter between primary and secondary education and entering a collegiate program in CS and then starting to embark on a career? So, I don’t know, let’s say there are 8 of these events between getting into programming and looking around for a job. If that’s true, then we need 3 times as many women studying computer science than men to get to the same number in our pipelines. Note that that’s 3 times more than men, not 3 times more than there are now. If we think about how many there are now, which, depending on your source, is between 1/3 and a 1/4 of the number of men, **to get to pipeline parity, we actually have to increase the number of women studying computer science by an entire order of magnitude**.\n\n## Prior art, or why maybe this isn’t so nuts after all\n\nSince gathering these findings and starting to talk about them a bit in the community, I began to realize that there was some supremely interesting academic work being done on gender differences around self-perception, confidence, and performance. Some of the work below found slightly different trends than we did, but it’s clear that anyone attempting to answer the question of the gender gap in tech would be remiss in not considering the effects of confidence and self-perception in addition to the more salient matter of bias.\n\nIn a [study investigating the effects of perceived performance to likelihood of subsequent engagement](https://s3.wp.wsu.edu/uploads/sites/252/2014/10/EhrlingerDunning2003.pdf), Dunning (of Dunning-Kruger fame) and Ehrlinger administered a scientific reasoning test to male and female undergrads and then asked them how they did. Not surprisingly, though there was no difference in performance between genders, women underrated their own performance more often than men. Afterwards, participants were asked whether they’d like to enter a Science Jeopardy contest on campus in which they could win cash prizes. Again, women were significantly less likely to participate, with participation likelihood being directly correlated with self-perception rather than actual performance.[3](https://interviewing.io/blog/voice-modulation-gender-technical-interviews#user-content-fn-3)\n\nIn a different study, [sociologists followed a number of male and female STEM students over the course of their college careers](https://www.researchgate.net/publication/232564809_The_Validity_and_Utility_of_Selection_Methods_in_Personnel_Psychology) via diary entries authored by the students. One prevailing trend that emerged immediately was the difference between how men and women handled the “discovery of their \\[place in the\\] pecking order of talent, an initiation that is typical of socialization across the professions.” For women, realizing that they may no longer be at the top of the class and that there were others who were performing better, “the experience \\[triggered\\] a more fundamental doubt about their abilities to master the technical constructs of engineering expertise \\[than men\\].”\n\nAnd of course, what survey of gender difference research would be complete without an allusion to the wretched annals of dating? When I told the interviewing.io team about the disparity in attrition between genders, the resounding response was along the lines of, “Well, yeah. Just think about dating from a man’s perspective.” Indeed, [a study published in the _Archives of Sexual Behavior_](https://link.springer.com/article/10.1023/B:ASEB.0000028892.63150.be) confirms that men treat rejection in dating very differently than women, even going so far as to say that men “reported they would experience a more positive than negative affective response after… being sexually rejected.”\n\nMaybe tying coding to sex is a bit tenuous, but, as they say, programming is like sex — one mistake and you have to support it for the rest of your life.\n\n## Why I’m not depressed by our results and why you shouldn’t be either\n\nPrior art aside, I would like to leave off on a high note. I mentioned earlier that men are doing a lot better on the platform than women, but here’s the startling thing. **Once you factor out interview data from both men and women who quit after one or two bad interviews, the disparity goes away entirely.** So while the attrition numbers aren’t great, I’m massively encouraged by the fact that at least in these findings, it’s not about systemic bias against women or women being bad at computers or whatever. Rather, it’s about women being bad at dusting themselves off after failing, which, despite everything, is probably a lot easier to fix.\n\n## Footnotes\n\n## Footnotes\n\n1. Roughly 15% of our users are female. We want way more, but it’s a start. [↩](https://interviewing.io/blog/voice-modulation-gender-technical-interviews#user-content-fnref-1)\n\n2. If you want to hear more examples of voice modulation or are just generously down to indulge me in some shameless bragging, we got to demo it on [NPR](https://www.npr.org/2016/04/12/473912220/blind-hiring-while-well-meaning-may-create-unintended-consequences) and in [Fast Company](https://www.fastcompany.com/3059522/this-interviewing-platform-changes-your-voice-to-eliminate-unconscious-bias). [↩](https://interviewing.io/blog/voice-modulation-gender-technical-interviews#user-content-fnref-2)\n\n3. In addition to asking interviewers how interviewees did, [we also ask interviewees to rate themselves](https://strapi-iio.s3.us-west-2.amazonaws.com/8ddad_interviewee_feedback_be549dadfb.png). After reading the Dunning and Ehrlinger study, we went back and checked to see what role self-perception played in attrition. In our case, the answer is, I’m afraid, TBD, as we’re going to need more self-ratings to say anything conclusive. [↩](https://interviewing.io/blog/voice-modulation-gender-technical-interviews#user-content-fnref-3)\n\n\nLife is chaos and pain. Interview prep doesn't have to be.\n\n![Video Preview](https://interviewing.io/static/images/cyber-corgi/artboard.svg)\n\nGet instant access to anonymous mock interviews, salary negotiation, and the world's largest library of interview replays.\n\n[Get started](https://interviewing.io/signup)\n\n#### Related posts\n\n[I love meritocracy, but all the recent anti-DEI rhetoric is bad](https://interviewing.io/blog/i-love-meritocracy-but-all-the-recent-anti-dei-rhetoric-is-bad)\n\n[Our business depends on having the best interviewers, so we built an interviewer rating system. And you can too.](https://interviewing.io/blog/our-business-depends-on-having-the-best-interviewers-so-we-built-an-interviewer-rating-system-and-you-can-too)\n\n[Why AI can’t do hiring](https://interviewing.io/blog/why-ai-cant-do-hiring)\n\n[Does communication matter in technical interviewing? We looked at 100K interviews to find out.](https://interviewing.io/blog/does-communication-matter-in-technical-interviewing-we-looked-at-100k-interviews-to-find-out)\n\n#### Stuff we write about\n\n[Recession](https://interviewing.io/blog/category/recession) [Salary negotiation](https://interviewing.io/blog/category/salary-negotiation) [Company News](https://interviewing.io/blog/category/company-news) [Data Deep Dives](https://interviewing.io/blog/category/data-deep-dives) [Diversity](https://interviewing.io/blog/category/diversity) [Guest Posts](https://interviewing.io/blog/category/guest-posts) [Hiring is broken](https://interviewing.io/blog/category/hiring-is-broken) [Interview tips](https://interviewing.io/blog/category/interview-tips) [For employers, how to hire better](https://interviewing.io/blog/category/for-employers-how-to-hire-better)\n\n### Have interviews coming up? Study up on common questions and topics.\n\nHARD\n\nSystem Design\n\n### [Design WhatsApp](https://interviewing.io/questions/design-whatsapp)\n\n[Design a message app system and client (e.g. WhatsApp) supporting a list of requirements.](https://interviewing.io/questions/design-whatsapp)\n\nMEDIUM\n\nData Structures and Algorithms\n\n### [LRU Cache](https://interviewing.io/questions/lru-cache)\n\n[Implement an LRU Cache\\\\\n\\\\\nLRU = Least recently used cache](https://interviewing.io/questions/lru-cache)\n\nMEDIUM\n\nData Structures and Algorithms\n\n### [Integer Replacement](https://interviewing.io/questions/integer-replacement)\n\n[Given an integer as an input, replace all the digits ‘0’ with ‘5’ in the integer.](https://interviewing.io/questions/integer-replacement)\n\n[Sorting](https://interviewing.io/sorting-interview-questions)\n\n[Questions \\\\\n\\\\\n& tips](https://interviewing.io/sorting-interview-questions)\n\n[Sets](https://interviewing.io/sets-interview-questions)\n\n[Questions \\\\\n\\\\\n& tips](https://interviewing.io/sets-interview-questions)\n\n[Buckets](https://interviewing.io/buckets-interview-questions)\n\n[Questions \\\\\n\\\\\n& tips](https://interviewing.io/buckets-interview-questions)\n\n[Binary Search](https://interviewing.io/binary-search-interview-questions)\n\n[Questions \\\\\n\\\\\n& tips](https://interviewing.io/binary-search-interview-questions)\n\n[Stacks](https://interviewing.io/stacks-interview-questions)\n\n[Questions \\\\\n\\\\\n& tips](https://interviewing.io/stacks-interview-questions)\n\n[Depth-First Search (DFS)](https://interviewing.io/depth-first-search-interview-questions)\n\n[Questions \\\\\n\\\\\n& tips](https://interviewing.io/depth-first-search-interview-questions)\n\n## We know exactly what to do and say to get the company, title, and salary you want.\n\nInterview prep and job hunting are chaos and pain. We can help. Really.\n\n![Google Icon](https://interviewing.io/static/images/icon--google-color.svg)\nGet started for free\n\n![App screenshot](https://interviewing.io/_next/image?url=%2Fstatic%2Fimages%2FFooterImg.png&w=3840&q=75)",
        "content_type": "web_page",
        "source_url": null,
        "author": "",
        "user_id": ""
      }
    ]
  },
  {
    "team_id": "4",
    "items": [
      {
        "title": "I’ve never written code, but I just passed a Google system design interview.",
        "content": "We helped write the sequel to \"Cracking the Coding Interview\". [Read 9 chapters for free →](https://bctci.co/free-chapters)\n\n[interviewing.io](https://interviewing.io/)\n\nOpen menu\n\nInterview resources\n\n- [For employers](https://interviewing.io/employers)\n- [Gift mock interviews](https://interviewing.io/gift-practice-interviews)\n- [Blog](https://interviewing.io/blog)\n- [FAQ](https://interviewing.io/faq)\n- [Log in](https://start.interviewing.io/login)\n[Give it a try](https://interviewing.io/signup)\n\n# I’ve never written code, but I just passed a Google system design interview.\n\nBy Kevin Landucci \\| Published: August 9, 2023; Last updated: August 31, 2023\n\n## README and some disclaimers\n\n_Before you read this post, I (Aline Lerner, founder of interviewing.io) wanted to introduce it properly. It’s about something that’s a little bit nuts: a non-engineer passed a Google system design interview! What??! Surely something is misrepresented here, and surely something is overblown._\n\n_Here are the facts and some key context:_\n\n- _interviewing.io is an anonymous mock interview platform._\n- _We have hundreds of interviewers who are (or have recently been) senior, staff, and principal engineers at FAANG._\n- _We pay these interviewers to conduct anonymous mock interviews in the styles of their companies, and we instruct them to use at least the same bar that they would use in real life._\n- _We instruct our interviewers to never use proprietary questions or do anything that would jeopardize their NDAs with these companies._\n- _The Google interview in this post is a mock interview in the style of Google, conducted by a current or former Googler on our platform (we won’t say anything more about the interviewer to protect their identity, and we’ve also changed their voice). The interviewer didn’t have any context and thought this was a regular mock interview, and we stand behind its realism._\n- _To corroborate the results, we had a few independent Google interviewers evaluate the interview replay without knowing the context. Most interviewers said the question was realistic. One said that the question was too hard for an L4 candidate. Several said that the interviewer was too lenient, and one said that the candidate squeaked by in part because he made the interviewer believe he was already in process for an L5 role. One said the feedback was on point. We didn’t get consensus… but that somewhat tracks real life, where interviews are messy and outcomes are not deterministic._\n- _Even if the interviewer was a bit lenient, the fact that a non-engineer could pass or get close to passing a system design interview is nuts. It’s a testament to how teachable this material is, and it’s also a commentary on how these interviews are flawed and can be gamed, with enough effort. We are acutely aware of the shortcomings of the status quo and want to see a revolution in our industry as much as you do._\n\n_At the bottom of this post, you can watch the full interview and judge for yourself._\n\nMy name is Kevin. I am not and have never been a software engineer. I have never written or tested a single line of code, and I have never even worked as a PM. My tech career started in (don’t hate me!) recruiting. Then moved into career coaching and salary negotiation before I got where I am now: creating content for engineers.\n\nWith a fraction of the domain knowledge most engineers have, I passed a Google system design interview. I passed because I learned a LOT about system design interviews before taking this interview. I also learned a few tricks along the way. **If these tricks helped _me_ pass, then imagine what you’ll be able to do with them**.\n\n## How a non-coder learned a LOT about system design interviews\n\nAt interviewing.io, part of my job is talking to candidates about the interview process. Many complain about system design interviews. They don’t know how to approach them or how to handle the ambiguity. Here’s what one of our users had to say:\n\n> _System design interviews are very intimidating. The de facto assumption is that if you have worked for 5+ years, you should have excellent scalable systems experience and if you fail to show that at interviews, you're penalized either by not getting the offer or by getting down leveled significantly. The analogy I can think of is like asking an elephant to fly when the job description is to lift and move heavy things._\n\nAt the time, the most popular system design resources were eerily similar. None of them had good solutions for approaching, handling ambiguity in, or demystifying system design interviews. So, we decided to try to make the best system design guide in the world, and I got to lead the project.\n\nFirst, I talked to some of our highest-rated system design interviewers. Then, we started work on the guide. My role was to facilitate, listen, project manage, write, edit, and repeat.\n\nAfter months of work, we published [A Senior Engineer’s Guide to the System Design Interview](https://interviewing.io/guides/system-design-interview) on March 2nd, 2023. [It did well on Hacker News](https://news.ycombinator.com/item?id=34999464). If you Google “system design interview”, it’s the #1 result (as of when this post was published).\n\n## Why I decided to try doing a system design interview myself\n\nAfter the guide was released, I met again with some of the contributors. Out of nowhere, one said, “I bet you could pass a system design interview.” The other two agreed. I accepted the challenge and decided I wouldn’t study; I’d just use what I learned from making the guide.\n\nI scheduled a mock system design interview with an interviewer from Google on interviewing.io for a Friday morning. My interviewer wouldn’t know who I was and would only know my years of experience (I said I had 4). The only other thing my interviewer would know about me was that I presumably was about to interview at Google and needed help preparing.\n\n![How to book Google system design interviews on interviewing.io](https://strapi-iio.s3.us-west-2.amazonaws.com/sd_g_67800b6ebb.png)\n\nHow to book Google system design interviews on interviewing.io\n\n## Selected highlights from my system design interview\n\nI’ll walk you through a few clips from the interview that cover three key aspects of my experience: an unconventional idea, something I failed spectacularly at, and a moment I’m proud of.\n\n### An unconventional idea\n\nLast year, I went to Harvard Law School’s Advanced Negotiation Workshop. They spend a lot of time (33% of the whole workshop!) drilling into the specifics of how negotiations are often won or lost in the first and last 3 minutes. I approached the first 180 seconds of this system design interview with that in mind, and I knew I had to quickly score some social proof with the interviewer.\n\n[The unwritten codes of FAANG interviews](https://interviewing.io/guides/hiring-process) taught me one unobvious way to score social proof. Win the competition about who cares less. **I’m naturally enthusiastic so I had to trick myself. To find that devil-may-care attitude, I’d repeat a lyric from Green Day in my head: _“I don’t care that you don’t care.”_**\n\nSnippet 1 - YouTube\n\n[Photo image of interviewing.io](https://www.youtube.com/channel/UCNc-Wa_ZNBAGzFkYbAHw9eg?embeds_referring_euri=https%3A%2F%2Finterviewing.io%2F)\n\ninterviewing.io\n\n93K subscribers\n\n[Snippet 1](https://www.youtube.com/watch?v=6eF3eBxi9hU)\n\ninterviewing.io\n\nSearch\n\nWatch later\n\nShare\n\nCopy link\n\nInfo\n\nShopping\n\nTap to unmute\n\nIf playback doesn't begin shortly, try restarting your device.\n\nMore videos\n\n## More videos\n\nYou're signed out\n\nVideos you watch may be added to the TV's watch history and influence TV recommendations. To avoid this, cancel and sign in to YouTube on your computer.\n\nCancelConfirm\n\nShare\n\nInclude playlist\n\nAn error occurred while retrieving sharing information. Please try again later.\n\n[Watch on](https://www.youtube.com/watch?v=6eF3eBxi9hU&embeds_referring_euri=https%3A%2F%2Finterviewing.io%2F)\n\n0:00\n\n0:00 / 2:27\n•Live\n\n•\n\n[Watch on YouTube](https://www.youtube.com/watch?v=6eF3eBxi9hU \"Watch on YouTube\")\n\nIn this clip, I try to score some points in the first 180 seconds of the interview. Note that we swapped out both my voice and the interviewer’s voice, so it sounds a bit robotic, but the content is preserved.\n\n### Something I failed spectacularly at\n\nSimply put, I forgot you could cache data on a user’s device. More importantly, they grilled me about caching and I took it personally. I lost sight of the interview. Caught in a story of them as an adversary, I stopped listening. I ignored their follow-up questions and, ironically, their hints.\n\nAs Marcellus Wallace said in Pulp Fiction, \"Pride only hurts.\" I didn’t know the answers to their caching questions, and I was too proud to say “I don’t know.” Had I done that, they would’ve shifted gears. But I didn’t, so they assumed I actually did know, then the grilling continued. If I could go back in time, I’d do what our system design guide says to do when you’re not certain, but you have an idea.\n\n![](https://strapi-iio.s3.us-west-2.amazonaws.com/certainty_diagram_27234de7d3.webp)\n\nTell the interviewer:\n\n> _\"I don't know, I'm definitely going to look that up right after this interview, but if I had to give my best guess I'd say... \\[x\\] and here is why \\[explanation/thought process\\].\"_\n\nSnippet 3 - YouTube\n\n[Photo image of interviewing.io](https://www.youtube.com/channel/UCNc-Wa_ZNBAGzFkYbAHw9eg?embeds_referring_euri=https%3A%2F%2Finterviewing.io%2F)\n\ninterviewing.io\n\n93K subscribers\n\n[Snippet 3](https://www.youtube.com/watch?v=wnHJyPWfREg)\n\ninterviewing.io\n\nSearch\n\nWatch later\n\nShare\n\nCopy link\n\nInfo\n\nShopping\n\nTap to unmute\n\nIf playback doesn't begin shortly, try restarting your device.\n\nMore videos\n\n## More videos\n\nYou're signed out\n\nVideos you watch may be added to the TV's watch history and influence TV recommendations. To avoid this, cancel and sign in to YouTube on your computer.\n\nCancelConfirm\n\nShare\n\nInclude playlist\n\nAn error occurred while retrieving sharing information. Please try again later.\n\n[Watch on](https://www.youtube.com/watch?v=wnHJyPWfREg&embeds_referring_euri=https%3A%2F%2Finterviewing.io%2F)\n\n0:00\n\n0:00 / 1:49\n•Live\n\n•\n\n[Watch on YouTube](https://www.youtube.com/watch?v=wnHJyPWfREg \"Watch on YouTube\")\n\nIn this clip, I get flustered, yell, and get a hint. Note that we swapped out both my voice and the interviewer’s voice, so it sounds a bit robotic, but the content is preserved.\n\n### A moment I’m proud of\n\nBreaking Google’s record for the number of times “Harry Styles” is repeated in one interview! Just kidding. My actual proud moment was staying calm when the interviewer said something scary. A candidate who gets scared, looks like an outsider. To look like an insider, stay calm.\n\n> _A common system design question is ‘Design Gmail.’ There are so many different dimensions, no one can design Gmail during an interview. That can’t happen. Whenever people ask you to ‘Design Gmail,’ that's to scare you._\n>\n> -Former Staff Engineer at Google\n\nThe topic of scale came up. And the interviewer said this system should be able to support 800 million active users. That quote from that staff engineer popped into my head, so I–while feigning the most casual tone possible–responded with a neutral “okay.” The word choice and delivery suggest “this is another day at the office for me” which implies “I’m not scared of this.” In my head, what I told myself was “I don’t care that you don’t care.”\n\nSnippet 2 - YouTube\n\n[Photo image of interviewing.io](https://www.youtube.com/channel/UCNc-Wa_ZNBAGzFkYbAHw9eg?embeds_referring_euri=https%3A%2F%2Finterviewing.io%2F)\n\ninterviewing.io\n\n93K subscribers\n\n[Snippet 2](https://www.youtube.com/watch?v=BQz3orQJ0e4)\n\ninterviewing.io\n\nSearch\n\nWatch later\n\nShare\n\nCopy link\n\nInfo\n\nShopping\n\nTap to unmute\n\nIf playback doesn't begin shortly, try restarting your device.\n\nMore videos\n\n## More videos\n\nYou're signed out\n\nVideos you watch may be added to the TV's watch history and influence TV recommendations. To avoid this, cancel and sign in to YouTube on your computer.\n\nCancelConfirm\n\nShare\n\nInclude playlist\n\nAn error occurred while retrieving sharing information. Please try again later.\n\n[Watch on](https://www.youtube.com/watch?v=BQz3orQJ0e4&embeds_referring_euri=https%3A%2F%2Finterviewing.io%2F)\n\n0:00\n\n0:00 / 0:28\n•Live\n\n•\n\n[Watch on YouTube](https://www.youtube.com/watch?v=BQz3orQJ0e4 \"Watch on YouTube\")\n\nTalking about scale like you’ve been there before 😎 Note that we swapped out both my voice and the interviewer’s voice, so it sounds a bit robotic, but the content is correct.\n\n## The interviewer’s feedback from the interview\n\n![](https://strapi-iio.s3.us-west-2.amazonaws.com/feedback_93fb5e447f.png)\n\n**At 41:00, you can hear him give me a “Weak/Lean Hire” for L4.**\n\n## What I learned about system design interviews\n\nWithout a firm foundation, tricks lose their magic. You can have all the tricks in the world, but if you don’t know [the material](https://interviewing.io/guides/system-design-interview), it won’t be enough. That said, just knowing the material isn’t enough either because doing well is also about managing your own psychology. The main mental obstacle is the discomfort of not knowing.\n\nSet yourself up for the least amount of discomfort. Book an anonymous, mock system design interview with engineers from top companies. Keep your skills sharp.\n\n[See available times](https://interviewing.io/signup)\n\n![](https://interviewing.io/_next/image?url=%2F_next%2Fstatic%2Fmedia%2Fcta.47351a0d.png&w=1200&q=75)\n\nUnlike engineering problems, design problems are more about not knowing. There are no optimal solutions. Progress is not quantifiable. There are no predetermined outcomes. **It’s not enough to sum them up as ambiguous; they test your ability to thrive in ambiguity. Luckily, this can be learned through practice.** It is a way to think, communicate, and solve problems. So, the skills you learn are transferable, even from practices that seem unrelated.\n\n## Three ways to practice \"not knowing\"\n\nThey are: the \"not knowing\" game, improv class, and zen koans. Try one for 10 days. If your system design interview skills don’t improve, I’ll buy you a Coke. Share your experience, tell us what we should write about next, and add anything else in the Typeform at the end of this post.\n\n### First way: The \"not-knowing\" game\n\nThe way to play is to notice who knows stuff you don’t and then follow that thread. It’s easier with a topic you’re currently passionate about. For me, that’s art. I bring it up and listen for it everywhere. If someone mentions something I didn’t know, that’s a point. If they explain something I didn’t know, that’s double points. And if someone scores enough points: treat them like an old friend and see where it goes.\n\nThe other day, a stranger and I began talking at a café. A half hour later, we were in their house looking at their original copy of Dante’s Divine Trilogy which is about hell, purgatory, and heaven. It is hundreds of years old and surprisingly massive. Before this experience which was steeped in \"not knowing\"–an impromptu visit to a stranger’s house–I hadn’t even heard of this extremely rare art piece. After it, I had turned its pages (and not in a museum!!!).\n\n### Second way: Improv class\n\nIf unstructured conversation seems like hell, you might prefer an improv class such as clowning. There are two types of clowns: the high status (who “knows”) and the low status (who “doesn’t know”). Low status clowns do illogical things like jump when they’re told to sit. They are the rule breaking dopey sidekicks. When playing one, you tell yourself you have no idea what’s going on, and to be okay with that. This is similar to a meditative practice called “don’t know mind.”\n\n### Third way: Meditation\n\nIf strangers and clowns are scary, try meditation. Zen koans are a particularly baffling flavor of meditation. One is, “What is the sound of one hand clapping?” Another one is, “What is your original face, before even your parents were born?” Full of paradoxes and non-sequiturs which can’t be figured out with a normal rational everyday way of thinking, zen koans can teach you to thrive in ambiguity by yourself on an app. Shout out to all the introverts out there.\n\n## Conclusion\n\nTo do well in system design interviews, you need to do two things: first and foremost, you need to learn the material. Then, you need to practice “not knowing” to get better at handling ambiguity. With the ability to thrive in ambiguity, nothing in life is impossible. Without that ability, you might never crack that code, have that adventure, or save the world.\n\nWatch my full system design interview below:\n\nDesign Facebook Events: System Design Interview with a Google Engineer - YouTube\n\n[Photo image of interviewing.io](https://www.youtube.com/channel/UCNc-Wa_ZNBAGzFkYbAHw9eg?embeds_referring_euri=https%3A%2F%2Finterviewing.io%2F)\n\ninterviewing.io\n\n93K subscribers\n\n[Design Facebook Events: System Design Interview with a Google Engineer](https://www.youtube.com/watch?v=q3Gx99eq3E8)\n\ninterviewing.io\n\nSearch\n\nWatch later\n\nShare\n\nCopy link\n\nInfo\n\nShopping\n\nTap to unmute\n\nIf playback doesn't begin shortly, try restarting your device.\n\nMore videos\n\n## More videos\n\nYou're signed out\n\nVideos you watch may be added to the TV's watch history and influence TV recommendations. To avoid this, cancel and sign in to YouTube on your computer.\n\nCancelConfirm\n\nShare\n\nInclude playlist\n\nAn error occurred while retrieving sharing information. Please try again later.\n\n[Watch on](https://www.youtube.com/watch?v=q3Gx99eq3E8&embeds_referring_euri=https%3A%2F%2Finterviewing.io%2F)\n\n0:00\n\n0:00 / 47:19\n•Live\n\n•\n\n[Watch on YouTube](https://www.youtube.com/watch?v=q3Gx99eq3E8 \"Watch on YouTube\")\n\nIn this clip, I try to score some points in the first 180 seconds of the interview. Note that we swapped out both my voice and the interviewer’s voice, so it sounds a bit robotic, but the content is preserved.\n\nIf you have other topics you want us to write about, or feedback on this post, please leave it [here](https://iiosurveys.typeform.com/to/DvByB0ao).\n\nLife is chaos and pain. Interview prep doesn't have to be.\n\n![Video Preview](https://interviewing.io/static/images/cyber-corgi/artboard.svg)\n\nGet instant access to anonymous mock interviews, salary negotiation, and the world's largest library of interview replays.\n\n[Get started](https://interviewing.io/signup)\n\n#### Related posts\n\n[How to get in the door at top companies: a data-driven, practical guide for software engineers. Part 1.](https://interviewing.io/blog/how-to-get-in-the-door-at-top-companies-part-1)\n\n[Does communication matter in technical interviewing? We looked at 100K interviews to find out.](https://interviewing.io/blog/does-communication-matter-in-technical-interviewing-we-looked-at-100k-interviews-to-find-out)\n\n[How do I know if I’m ready to interview at FAANG?](https://interviewing.io/blog/how-know-ready-interview-faang)\n\n[6 red flags I saw while doing 60+ technical interviews in 30 days](https://interviewing.io/blog/6-red-flags-i-saw-while-doing-60-technical-interviews-in-30-days)\n\n#### Stuff we write about\n\n[Recession](https://interviewing.io/blog/category/recession) [Salary negotiation](https://interviewing.io/blog/category/salary-negotiation) [Company News](https://interviewing.io/blog/category/company-news) [Data Deep Dives](https://interviewing.io/blog/category/data-deep-dives) [Diversity](https://interviewing.io/blog/category/diversity) [Guest Posts](https://interviewing.io/blog/category/guest-posts) [Hiring is broken](https://interviewing.io/blog/category/hiring-is-broken) [Interview tips](https://interviewing.io/blog/category/interview-tips) [For employers, how to hire better](https://interviewing.io/blog/category/for-employers-how-to-hire-better)\n\n### Have interviews coming up? Study up on common questions and topics.\n\nEASY\n\nData Structures and Algorithms\n\n### [Reverse String](https://interviewing.io/questions/reverse-string)\n\n[Write a program to reverse the given string.](https://interviewing.io/questions/reverse-string)\n\nMEDIUM\n\nData Structures and Algorithms\n\n### [Partition Equal Subset Sum](https://interviewing.io/questions/partition-equal-subset-sum)\n\n[Given an array of positive numbers, determine if the array can be split such that the two partition sums are equal.](https://interviewing.io/questions/partition-equal-subset-sum)\n\nMEDIUM\n\nData Structures and Algorithms\n\n### [Binary Tree Upside Down](https://interviewing.io/questions/binary-tree-upside-down)\n\n[Given a binary tree where every node has either 0 or 2 children and every right node is a leaf node, flip it upside down turning it into a binary tree where all left nodes are leaf nodes.](https://interviewing.io/questions/binary-tree-upside-down)\n\n[Arrays](https://interviewing.io/arrays-interview-questions)\n\n[Questions \\\\\n\\\\\n& tips](https://interviewing.io/arrays-interview-questions)\n\n[Buckets](https://interviewing.io/buckets-interview-questions)\n\n[Questions \\\\\n\\\\\n& tips](https://interviewing.io/buckets-interview-questions)\n\n[Stacks](https://interviewing.io/stacks-interview-questions)\n\n[Questions \\\\\n\\\\\n& tips](https://interviewing.io/stacks-interview-questions)\n\n[MapReduce](https://interviewing.io/mapreduce-interview-questions)\n\n[Questions \\\\\n\\\\\n& tips](https://interviewing.io/mapreduce-interview-questions)\n\n[Dynamic Programming](https://interviewing.io/dynamic-programming-interview-questions)\n\n[Questions \\\\\n\\\\\n& tips](https://interviewing.io/dynamic-programming-interview-questions)\n\n[Binary Search](https://interviewing.io/binary-search-interview-questions)\n\n[Questions \\\\\n\\\\\n& tips](https://interviewing.io/binary-search-interview-questions)\n\n## We know exactly what to do and say to get the company, title, and salary you want.\n\nInterview prep and job hunting are chaos and pain. We can help. Really.\n\n![Google Icon](https://interviewing.io/static/images/icon--google-color.svg)\nGet started for free\n\n![App screenshot](https://interviewing.io/_next/image?url=%2Fstatic%2Fimages%2FFooterImg.png&w=3840&q=75)",
        "content_type": "web_page",
        "source_url": null,
        "author": "",
        "user_id": ""
      }
    ]
  },
  {
    "team_id": "4",
    "items": [
      {
        "title": "Why we’re pausing our Pay Later Program",
        "content": "We helped write the sequel to \"Cracking the Coding Interview\". [Read 9 chapters for free →](https://bctci.co/free-chapters)\n\n[interviewing.io](https://interviewing.io/)\n\nOpen menu\n\nInterview resources\n\n- [For employers](https://interviewing.io/employers)\n- [Gift mock interviews](https://interviewing.io/gift-practice-interviews)\n- [Blog](https://interviewing.io/blog)\n- [FAQ](https://interviewing.io/faq)\n- [Log in](https://start.interviewing.io/login)\n[Give it a try](https://interviewing.io/signup)\n\n# Why we’re pausing our Pay Later Program\n\nBy Aline Lerner \\| Published: September 28, 2022; Last updated: May 1, 2023\n\nIf you’ve been following the history of interviewing.io, then you’ll know we took a bunch of sharp turns during our journey. I’ll spare you the long version (you can find that in our [announcement that we’re out of beta](https://interviewing.io/blog/interviewing-io-is-out-of-beta-anonymous-technical-interview-practice-for-all), as well as our [Series A announcement](https://interviewing.io/blog/weve-raised-our-series-a), but the TL;DR is that we used to make money from employers, and mock interviews were free for engineers. Then hiring basically froze when COVID-19 happened, and to survive, we started charging engineers. We didn’t feel great about it, but the company would have shut down otherwise. The silver lining was that this allowed us to open up interviewing.io to engineers of all experience levels and in more locations and also meant that we no longer needed to throttle how many mock interviews people could do.\n\nWhen I announced that we were starting to charge our users, I promised 2 things: (1) We would start a Fellowship program for engineers from non-traditional backgrounds, where they could receive mentorship and practice for free, and (2) We would create a program where you didn’t have to pay for practice till you got a job.\n\nWe launched our [Technical Interview Practice Fellowship](https://interviewing.io/blog/announcing-the-interviewing-io-technical-interview-practice-fellowship) in 2020 and have completed 2 successful cohorts so far. We also launched our beta deferred payment program in September 2020 and ran it for a year to see what portion of users would get jobs and pay us back. When that was successful, we followed it in January 2021 with a much bigger, fully productized version called the Pay Later Program.\n\nUnfortunately, we recently made the very difficult decision to pause our Pay Later Program. In this post, we’ll talk about why we made that call and what we’ll be doing instead to ensure that engineers who can’t afford to pay for practice will still be able to get it. We’ll also explain some things we’ve learned along the way about funnel optimization, some mistakes we made while iterating on this program, and what we’ll do differently when we hopefully unpause it in the future.\n\nBut first, some history.\n\n## Our beta deferral program\n\nEver since we started charging, we wanted to give users a way to de-risk buying interview practice. **However, we didn’t want to subject our users to lengthy and invasive loan applications.** I had seen what some Income Share Agreement (ISA) application processes looked like, and they turned my stomach – many demanded bank account info so they could periodically check on your purchases. In one demo we saw, one of these firms bragged that if a student was spending too much money at Starbucks, it could be a sign that it was time to collect.\n\nWe didn’t want any part of that. We also wanted to distance ourselves from ISAs in general – mock interviews don’t cost tens of thousands of dollars, so with us, you wouldn’t have to give us a portion of your income. You’d just defer paying us for some number of mock interviews, which would usually run you somewhere between $500-$1000 depending on the number of interviews. So, we decided we’d ideally backstop this program ourselves, and as a precursor, we ran the beta deferral program for a year to see what kinds of payback rates we’d get.\n\nBelow are the terms of the original deferral program. While this program was in beta, most of our enrollment flow was in Typeform. It looked like this:\n\n![Deferral program application - page 1 - about the program](https://interviewing.io/_next/image?url=https%3A%2F%2Fstrapi-iio.s3.us-west-2.amazonaws.com%2Fdeferral_program_application_page_1_a107f6db8f.png&w=1920&q=75)\n\nThen we’d ask a few questions, and the final step of the form was to sign a contract, like so:\n\n![Deferral program application - page 2 - agreement terms](https://interviewing.io/_next/image?url=https%3A%2F%2Fstrapi-iio.s3.us-west-2.amazonaws.com%2Fdeferral_program_application_page_2_2222461614.png&w=1920&q=75)\n\n**After 4 months, we saw a 70% payback rate, and after 6 months, it was around 90%.** Between September 2020 and September 2021, over 500 beta users enrolled in this program, and feedback was overwhelmingly positive.\n\nWe felt great about this; however, we knew that the execution of the beta was still clunky. Typeform was our whole UI, and our back-end included a bunch of manual work held together with chewing gum and a massive spreadsheet, where we tracked enrollments, statuses, and paybacks.\n\nWhen we saw that the deferral program was clearly working, we decided to go all in, remove the manual work, and productize it properly.\n\n## The shiny new Pay Later Program\n\nThe new Pay Later Program would be a fully automated, shiny version of what we had cobbled together in the beta. The terms would be streamlined, enrollment would be easier, check-in emails would be automatic, and everything would just… _work._ As such, we took a critical look at the deferral program flow and all of the operational pain points and decided to streamline them as much as possible.\n\nBecause so many people in the old deferral program reached out asking to upgrade their algorithmic interviews to something more specialized (e.g., “I want to practice machine learning instead,” “I want an interviewer specifically from Google/Amazon/Facebook”), we decided to make the next version easier for everyone by just giving users interviewing.io credits.\n\nWhen you enrolled in the program, you’d start with $512 or $1024 in credits (your choice) that you could spend on any mock interview or mentorship session that you liked.\n\n**We launched our Pay Later Program at the end of December 2021. As we usually do with new features, we A/B tested a few different variants, with the intent of increasing enrollment as much as possible each time.**\n\nOur first iteration of Pay Later was almost identical to its predecessor, the deferral program, except that instead of having to fill out a Typeform, the enrollment flow was in our app. Here’s how it looked:\n\n![Screenshot of the Deferral Program enrollment form - personal details and credit amount](https://interviewing.io/_next/image?url=https%3A%2F%2Fstrapi-iio.s3.us-west-2.amazonaws.com%2FScreen_Shot_2022_09_28_at_5_41_04_PM_efb0b88942.png&w=828&q=75)\n\nThe only out-of-app part of the experience was having to sign a contract in HelloSign. We also had a very wordy explanation of the terms. It was a wall of text, much like the first page of the old Typeform.\n\n**Over time, as we continued to A/B test, we pruned more and more steps, tried different UIs, and even changed up the terms. We were ultimately able to more than _double_ enrollment in the Pay Later Program.** The 3 biggest and most impactful changes we made were:\n\n- Removing the contract-signing step entirely. Instead, we just asked users to check a box that said, “I agree to the terms of the Pay Later Program,” where clicking into the terms opened them in a new tab (see the screenshot below). _This was by far the most impactful change._\n- Making our terms more lax. Instead of charging you 4 months later, if you stayed at your job, we amended the terms to make it so you could get as many extensions as you needed, as long as you were still looking for a job (in good faith).\n- Condensing the terms summary from the wordy bullets in the original Typeform to the blue box below:\n\n![Screenshot of the Deferral Program enrollment form - provide a valid credit card](https://interviewing.io/_next/image?url=https%3A%2F%2Fstrapi-iio.s3.us-west-2.amazonaws.com%2Fpay_later_program_page_1_55f906a475.png&w=1200&q=75)\n\n## The dangers of funnel hacking\n\nOur new Pay Later Program was objectively better for users than our old deferral program for 2 reasons. First, it was more flexible – users got credits they could spend however they wished, instead of 5 algorithmic interviews that they’d have to pay to upgrade. Second, the terms were more generous and user-friendly – you didn’t have to pay us back if you stayed at your old job, as long as you promised us you were still looking, whereas in the old deferral program if you stayed at your current job, you’d have to pay back the full amount after 4 months.\n\n**Despite the offering being objectively better, user feedback was objectively worse.**\n\nIn our quest to increase funnel throughput, we made enrollment too frictionless. **By no longer requiring people to sign a contract and by basically creating 2-click enrollment with an abbreviated TL;DR that glossed over the mechanics of payback** (we’ll send you an email, we’ll charge if we don’t hear back from you, you’re on the hook for the full amount and any unused credits are yours to keep in perpetuity), **we failed to sufficiently explain the program to users, many of whom were justifiably shocked when they got billed.**\n\nReading a contract and signing it forced users to think through whether they were willing to be on the hook for a non-trivial amount of money. When we made enrollment as easy as clicking a few buttons, many users (understandably) no longer read the terms and made assumptions about how the program worked. These assumptions varied from “I thought these interviews were free” to “I thought I only had to pay if I got a job specifically at Google” to “I never signed up for this.”\n\nWith that in mind, of course it made sense that some portion of our users were irate and called us a scam when we emailed to ask if they were ready to pay us back. What sucked is that, even though we created this program with the best of intentions and modified the terms to make them more permissive, because of how we packaged and presented it, we experienced a very different response than from the original deferral program.\n\nThough the majority of users still paid us back within the 4 month period, there was now an angry and disappointed vocal minority, and our ops team began to dread the end of the month, when we’d invariably receive a number of irate emails stating that interviewing.io was a scam.\n\n**I don’t feel great that I got caught up in the funnel hacking and in seeing enrollment numbers increase.** If you’ve read my writing over the years, you’ll know that I take pride in transparency, candor, and clarity. You may also know that our one core value as a company is putting our users (i.e., engineers practicing for interviews) first. I didn’t live up to that this time, and I am sorry.\n\n**Practically speaking, I’ve learned that creating some amount of friction is necessary when you’re asking people to promise to pay you ~$1000 in the future. Removing that friction can create short-term wins but may hurt you (and disappoint your users) in the long run.**\n\nNow, you might expect that if we just revert the flow and bring back the friction, everything will be great again. Unfortunately not.\n\n## Why we’re pausing\n\nIn the current economic climate, we’ve had to take a hard look at our business and, like many other companies, cut our burn and tighten our belts. When we launched the program and committed to backstopping it ourselves, it was with the expectation that hiring would continue at a healthy clip. We anticipated a hiring slowdown in the recession, but multiple FAANGs freezing hiring was beyond what we had predicted – all of our models and assumptions had been based on COVID-era economics. This was something new.\n\nThe reality is that because the payback period is at least 4 months, regardless, as long as we’re running it, we are losing 4 months of runway. In this climate that’s significant.\n\nDespite that, we knew that for some portion of our users, the existence of this program would be the difference between being able to practice and not, so we looked into financing it through a third party. Here’s how we did the math:\n\n1. Estimate our enrollment rate in the Pay Later Program if we go back to the old UI/UX and terms.\n2. Estimate our payback rate for the Pay Later Program moving forward\n3. Cross-reference (1) and (2) with the interest rates we’d be paying to finance the program\n\n**Unfortunately, no matter how we ran the numbers, we couldn’t find a way to make this program ROI positive in the near term, especially with the reduction in enrollment we’d expect upon adding friction back into our enrollment process**, which we decided would be a hard requirement for bringing back the program – we learned to be careful with growth hacks through the mistakes we made with this program, and we will not repeat them.\n\nIn summary, the old flow had a lot of friction, and in the current climate, enrollment rates would be too low to justify its existence. The new flow had significantly more enrollment, but it made it too easy for users to enroll without grokking the terms, and this generated enough negative feedback from users to make us want to kill it, especially given our company’s core value of putting our engineering community first. Finally, even if we kept tweaking the old flow to find the perfect balance, payback rates within a reasonable time window would be too low to be ROI positive when we factor in the cost of financing this program by a 3rd party, which we’d need to do to conserve cash.\n\nIt’s possible we’ll bring this program back in the future, but if we do, it’ll look substantially different from what we released in 2022.\n\n## What about users who are already enrolled in the Pay Later Program?\n\nIf you’re already enrolled, you’re good! Your credits will continue to work in perpetuity, just like we promised, and we’ll honor the terms: You get extensions as long as you haven’t found a job and are still actively looking.\n\n## What we’re doing instead to help those who can’t afford to pay for practice\n\nWe realize that many of you were depending on this program to be able to practice, especially during a recession. Even though we’ve paused our Pay Later Program, until we hopefully bring it back in the future, we have a few other ways that we can make it easier for you to get the practice you need.\n\n- We still have peer-to-peer practice interviews, where you get matched with other interviewing.io users and work problems together. We introduced these right after COVID-19, and they’re not going anywhere. You get 1 interview with a peer when you join the platform, and after that, you can unlock more by conducting interviews yourself. We’ll be looking at this program to see how we can make it more accessible.\n- We’ll be starting the next cohort of our Fellowship for engineers from non-traditional backgrounds soon.\n- We’re experimenting with a few other ideas that may, together, fill the void created by the Pay Later Program. One of the more promising items is implementing Affirm, which will let our users defer payment for practice or pay it in smaller chunks.\n\nThis was a hard post to write, and I welcome feedback. You can always reach me at [aline@interviewing.io](mailto:aline@interviewing.io).\n\nLife is chaos and pain. Interview prep doesn't have to be.\n\n![Video Preview](https://interviewing.io/static/images/cyber-corgi/artboard.svg)\n\nGet instant access to anonymous mock interviews, salary negotiation, and the world's largest library of interview replays.\n\n[Get started](https://interviewing.io/signup)\n\n#### Related posts\n\n[Building interviewing.io's collaborative & replayable whiteboard, or making systems design interviews not suck](https://interviewing.io/blog/building-interviewing-ios-collaborative-replayable-whiteboard)\n\n[Announcing our Pay Later Program: Don’t pay for mock interviews until you get a job](https://interviewing.io/blog/announcing-our-pay-later-program-dont-pay-for-mock-interviews-until-you-get-a-job)\n\n[interviewing.io is finally out of beta. Anonymous technical interview practice for all!](https://interviewing.io/blog/interviewing-io-is-out-of-beta-anonymous-technical-interview-practice-for-all)\n\n[We co-wrote the official sequel to Cracking the Coding Interview!](https://interviewing.io/blog/we-co-wrote-the-official-sequel-to-cracking-the-coding-interview-introducing-beyond-ctci)\n\n#### Stuff we write about\n\n[Recession](https://interviewing.io/blog/category/recession) [Salary negotiation](https://interviewing.io/blog/category/salary-negotiation) [Company News](https://interviewing.io/blog/category/company-news) [Data Deep Dives](https://interviewing.io/blog/category/data-deep-dives) [Diversity](https://interviewing.io/blog/category/diversity) [Guest Posts](https://interviewing.io/blog/category/guest-posts) [Hiring is broken](https://interviewing.io/blog/category/hiring-is-broken) [Interview tips](https://interviewing.io/blog/category/interview-tips) [For employers, how to hire better](https://interviewing.io/blog/category/for-employers-how-to-hire-better)\n\n### Have interviews coming up? Study up on common questions and topics.\n\nMEDIUM\n\nData Structures and Algorithms\n\n### [Copy List With Random Pointers](https://interviewing.io/questions/copy-list-with-random-pointers)\n\n[Given a linked list with nodes that have an additional pointer referring to another node in the list, return a deep copy of the list.](https://interviewing.io/questions/copy-list-with-random-pointers)\n\nMEDIUM\n\nData Structures and Algorithms\n\n### [Three Sum](https://interviewing.io/questions/three-sum)\n\n[Given an array of integers, return an array of triplets such that i != j != k and nums\\[i\\] + nums\\[j\\] + nums\\[k\\] = 0.](https://interviewing.io/questions/three-sum)\n\nEASY\n\nSystem Design\n\n### [File Parsing](https://interviewing.io/questions/file-parsing)\n\n[Given an inefficient file structure, how would you store data to efficiently look up the query? How would you alter this if you had many computers available?](https://interviewing.io/questions/file-parsing)\n\n[Two Pointers](https://interviewing.io/two-pointers-interview-questions)\n\n[Questions \\\\\n\\\\\n& tips](https://interviewing.io/two-pointers-interview-questions)\n\n[Arrays](https://interviewing.io/arrays-interview-questions)\n\n[Questions \\\\\n\\\\\n& tips](https://interviewing.io/arrays-interview-questions)\n\n[Depth-First Search (DFS)](https://interviewing.io/depth-first-search-interview-questions)\n\n[Questions \\\\\n\\\\\n& tips](https://interviewing.io/depth-first-search-interview-questions)\n\n[Heaps](https://interviewing.io/heaps-interview-questions)\n\n[Questions \\\\\n\\\\\n& tips](https://interviewing.io/heaps-interview-questions)\n\n[System Design](https://interviewing.io/system-design-interview-questions)\n\n[Questions \\\\\n\\\\\n& tips](https://interviewing.io/system-design-interview-questions)\n\n[Hash Maps](https://interviewing.io/hash-tables-interview-questions)\n\n[Questions \\\\\n\\\\\n& tips](https://interviewing.io/hash-tables-interview-questions)\n\n## We know exactly what to do and say to get the company, title, and salary you want.\n\nInterview prep and job hunting are chaos and pain. We can help. Really.\n\n![Google Icon](https://interviewing.io/static/images/icon--google-color.svg)\nGet started for free\n\n![App screenshot](https://interviewing.io/_next/image?url=%2Fstatic%2Fimages%2FFooterImg.png&w=3840&q=75)",
        "content_type": "web_page",
        "source_url": null,
        "author": "",
        "user_id": ""
      }
    ]
  }
]